// Съставете алгоритъм и напишете програма за намиране на произведението на всички елементи на едномерен масив,
// участващи в двойки от елементи, чиито суми са не по-големи от 120.

#include <stdio.h>

#define N 3

int main() {

    int a[N], i, j;
    double k = 1;

    for (i = 0; i < N; i++)
        scanf("%d", &a[i]);

    for (i = 0; i < N - 1; i++)
        for (j = i; j < N - 1; j++)
            if (a[i] + a[j + 1] <= 120)
                k = k * a[i] * a[j + 1];

    printf("\n%.2lf\n", k);

    return 0;

}
