// Програма за определяне дали дадена година е високосна
// година, деляща се на числото 4 без остатък, е високосна;
// ако годината обаче също се дели без остатък на 100, то тя не е високосна;
// но ако годината също се дели без остатък и на 400, то тя пак ще е високосна.

#include <stdio.h>

int main() {
   
    int n;

    printf("n = ");
    scanf("%d", &n);

    if ((n % 4 == 0 && n % 100 != 0) || (n % 400 == 0))    
        printf("YES\n");
    else
        printf("NO\n");

    return 0;

}
