// Съставете алгоритъм и напишете програма за намиране на броя на площадките на едномерен масив. 
// Площадка наричаме два или повече съседни и еднакви елемента на едномерен масив.

#include <stdio.h>

#define N 5

int main() {

    int a[N], i, j, p = 0;

    for (i = 0; i < N; i++)
        scanf("%d", &a[i]);

    for (i = 0; i < N - 1; i++)
        if (a[i] == a[i + 1]) {
            j = i;
            while (a[i] == a[j + 1])   
                j++;  
            p++;
            i = j; 
        }

    printf("p = %d\n", p);

    return 0;

}
