// Да се състави програма, чрез която се обработват елементите на двумерен масив по следния начин:
// а) всички нечетни елементи над главния диагонал да станат четни (чрез прибавяне на 1);
// б) всички четни елементи под главния диагонал да станат нечетни (чрез изваждане на 1);
// в) при всяка промяна съгласно условие а и б, елементът от главния диагонал в същия ред нараства с 1.

#include <stdio.h>

#define N 2
#define M 2

int main() {
  
    int i, j, arr[N][M];

    for (i = 0; i < N; i++)
        for (j = 0; j < M; j++) {
            printf("arr[%d][%d] = ", i, j);
            scanf("%d", &arr[i][j]);
        }

    for (i = 0; i < N; i++)
        for (j = 0; j < M; j++) {
            if ((j > i) && (arr[i][j] % 2 != 0)) {
                arr[i][j] = arr[i][j] + 1;
                arr[i][i]++;
            }
            if ((i > j) && (arr[i][j] % 2 == 0)) {
                arr[i][j] = arr[i][j] - 1;
                arr[i][i]++;
            }
        }

    for (i = 0; i < N; i++) {
        for (j = 0; j < M; j++)
            printf("%d ", arr[i][j]);
        printf("\n");
    }

    return 0;
  
}
