// Съставете алгоритъм и напишете програма, която намира броя на двойките елементи симетрични на главния диагонал на двумерен масив, 
// в които елементът над главния диагонал е по-малък от елементът под главния диагонал. Например,
// следните двойки от елементи са симетрични спрямо главния диагонал: а10 и а01; а20 и а02; а21 и а12; а30 и а03 и т.н.
// а00   а01   а02   а03
// а10   а11   а12   а13
// а20   а21   а22   а23
// а30   а31   а32   а33

#include <stdio.h>

#define N 3
#define M 3

int main() {
  
    int i, j, arr[N][M], k = 0;

    for (i = 0; i < N; i++)
        for (j = 0; j < M; j++)
        {
            printf("arr[%d][%d] = ", i, j);
            scanf("%d", &arr[i][j]);
        }

    for (i = 0; i < N - 1; i++)
        for (j = i + 1; j < M; j++)
            if (arr[i][j] < arr[j][i])
                k++;
    
    printf("k = %d\n", k);

    return 0;
  
}
